org/opt/backup.org

* backup linux home folder

** backup to tar


: time tar -cvzf 2019-08-28.tar.gz 2019-08-28/


: tar -xvzf compress.tgz -C /media/fh/F834F05534F01878/Users/fh/home

: tar -tzf 2017-06-19_titan_\[attributes\].tar.gz | grep "SONG0"


: tar -czf /media/../compress.tar.gz -C /media/../source/ compress_folder/



** backup ~/home/fh/~ with attributes
#+BEGIN_SRC sh
#!/bin/bash

DEST="/media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/"
DATE="2020-12-08"

mkdir -p $DEST$DATE"_titan-16.04_[attributes]"

time tar -czf  /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04.tar.gz -C /home/ fh/

cp -r --attributes-only /home/fh /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04_[attributes]/fh

time tar -czf /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04_[attributes].tar.gz -C /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/ 2020-12-08_titan-16.04_[attributes]

# rm -r /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04_[attributes]
#+END_SRC
