docs/opt/backup.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">backup linux home folder</a>
<ul class="nav">
<li><a href="#sec-">backup to tar</a></li>
<li><a href="#sec-">backup <code>/home/fh/</code> with attributes</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">backup linux home folder</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">backup to tar</h3>
<div class="outline-text-3" id="text-">
<pre class="example">
time tar -cvzf 2019-08-28.tar.gz 2019-08-28/
</pre>


<pre class="example">
tar -xvzf compress.tgz -C /media/fh/F834F05534F01878/Users/fh/home
</pre>

<pre class="example">
tar -tzf 2017-06-19_titan_\[attributes\].tar.gz | grep "SONG0"
</pre>


<pre class="example">
tar -czf /media/../compress.tar.gz -C /media/../source/ compress_folder/
</pre>
</div>
</div>



<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">backup <code>/home/fh/</code> with attributes</h3>
<div class="outline-text-3" id="text-">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #465a61; font-style: italic;">#</span><span style="color: #52676f; font-style: italic;">!/bin/</span><span style="color: #728a05;">bash</span>

<span style="color: #a57705;">DEST</span>=<span style="color: #259185;">"/media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/"</span>
<span style="color: #a57705;">DATE</span>=<span style="color: #259185;">"2020-12-08"</span>

mkdir -p $<span style="color: #a57705;">DEST</span>$<span style="color: #a57705;">DATE</span><span style="color: #259185;">"_titan-16.04_[attributes]"</span>

<span style="color: #5859b7;">time</span> tar -czf  /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04.tar.gz -C /home/ fh/

cp -r --attributes-only /home/fh /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04_[attributes]/fh

<span style="color: #5859b7;">time</span> tar -czf /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04_[attributes].tar.gz -C /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/ 2020-12-08_titan-16.04_[attributes]

<span style="color: #465a61; font-style: italic;"># </span><span style="color: #52676f; font-style: italic;">rm -r /media/fh/18e27f38-eaa8-43c7-81e9-b60d1c84c086/backup/2020-12-08_titan-16.04_[attributes]</span>
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
</body>
</html>
